import Link from "next/link";
import React from "react";
import { IoIosArrowForward } from "react-icons/io";

export default function AboutUs() {
  return (
    <div className=" container">
      <h1 className=" mt-[30px] text-[42px] font-semibold leading-[57px]">
        নিউজপেপার সম্পর্কে জানুন
      </h1>
      <div className=" flex gap-[5px] items-center pb-3 border-b-[1px] border-gray-200 mb-[26px]">
        <Link href={"/"}>
          <p className=" mb-0 text-base hover:text-primary">হোম</p>
        </Link>
        <IoIosArrowForward className="text-primary" />
        <p className=" mb-0 text-base">নিউজপেপার সম্পর্কে জানুন</p>
      </div>
      <div className=" grid gap-[25px]">
        <p className=" text-[18px] leading-[32px]">
          ছাপা পত্রিকা, ওয়েব পোর্টাল, দুটি মাসিক ম্যাগাজিন (কিশোর আলো ও
          বিজ্ঞানচিন্তা), নিয়মিত ম্যাগাজিন বর্ণিল এবং ঈদসংখ্যার মতো বিশেষ
          ম্যাগাজিন, প্রথমা প্রকাশন, বছরব্যাপী গোলটেবিল আলোচনা, ইভেন্টস (শিক্ষা,
          সাংস্কৃতিক ও সামাজিক কার্যক্রমসমূহ), নিউজপেপার ট্রাস্ট, নিউজপেপার
          বন্ধুসভা ইত্যাদি উদ্যোগ মিলে এক হাজারেরও বেশি কর্মী নিয়ে নিউজপেপার
          দেশের বৃহত্তম মিডিয়া প্রতিষ্ঠান। নিউজপেপার দেশের খ্যাতনামা শিল্পগোষ্ঠী
          ট্রান্সকম গ্রুপের অঙ্গপ্রতিষ্ঠান মিডিয়াস্টার লিমিটেডের মালিকানাভুক্ত।
          ঢাকা, চট্টগ্রাম ও বগুড়া—এই তিন জায়গা থেকে প্রতিদিন নিউজপেপারর ১০টি
          সংস্করণ মুদ্রিত হয়। বিচিত্র সামাজিক, সাংস্কৃতিক ও শিক্ষামূলক
          কার্যক্রমের উদ্যোক্তা হিসেবে বলা হয়ে থাকে, ‘নিউজপেপার পত্রিকার চেয়ে
          একটু বেশি’।
        </p>
        <p className=" text-[18px] leading-[32px]">
          যুক্তরাজ্যভিত্তিক সমীক্ষাপ্রতিষ্ঠান ক্যান্টার এমআরবি পরিচালিত জাতীয়
          গণমাধ্যম জরিপ ২০২১ অনুসারে, প্রতিদিন ৫০ লাখের বেশি মানুষ নিউজপেপারর
          ছাপা পত্রিকা পড়ে থাকেন। এই জরিপে দেখা গেছে, নিউজপেপারই বাংলাদেশে
          সর্বোচ্চ পঠিত পত্রিকা।
        </p>
        <p className=" text-[18px] leading-[32px]">
          পাঠকসংখ্যা ও পেজভিউর হিসাবেও নিউজপেপার পোর্টাল বিশ্বে বাংলা ভাষার এক
          নম্বর ওয়েবসাইট। প্রতি মাসে এর ভিজিটর প্রায় ১ কোটি ৬০ লাখ এবং মাসিক
          পেজভিউ প্রায় ২২ কোটি। ১ কোটি ৯৬ লাখ অনুসারী নিয়ে নিউজপেপারর ফেসবুক পেজ
          এখন বাংলাদেশে ব্যক্তি ও প্রাতিষ্ঠানিক পেজের মধ্যে সবার শীর্ষে।
        </p>
        <p className=" text-[18px] leading-[32px]">
          নিউজপেপারর আত্মপ্রকাশ ১৯৯৮ সালের ৪ নভেম্বর। বস্তুনিষ্ঠ, স্বাধীন ও
          দলনিরপেক্ষ একটি দৈনিক পত্রিকা হিসেবে এমন এক সময়ে এর যাত্রা শুরু, যখন
          ১৯৯০ সালে সামরিক স্বৈরতন্ত্র উচ্ছেদের এক দশকও পার হয়নি এবং বাংলাদেশ
          নতুন করে তার গণতন্ত্রের পথ রচনার চেষ্টা করছে। পত্রিকার পাশাপাশি শুরু
          থেকেই ডিজিটাল পরিসরে নিউজপেপার সংবাদ প্রচার করতে শুরু করে। ২০০৯ সালের
          ১৭ মে তারিখে হয় এর ওয়েব পোর্টালের আনুষ্ঠানিক উদ্বোধন। এর আগে একই বছরের
          ৫ এপ্রিল চালু হয় নিউজপেপারর ই–পেপার
        </p>

        <p className=" text-[18px] leading-[32px]">
          পত্রিকা প্রকাশের সূচনা থেকেই শ্রেণি, বয়স, লিঙ্গ, সম্প্রদায় ও
          মতবিশ্বাস-নির্বিশেষে সবার তথ্য ও মতামতের চাহিদার প্রতি নিউজপেপার সজাগ
          থেকেছে। এর সম্পাদকীয় নীতির কেন্দ্রে রয়েছে উদার ও বহুবাচনিক গণতন্ত্র,
          অসাম্প্রদায়িকতা, মুক্তিযুদ্ধের চেতনার প্রতি অবিচল দায়বদ্ধতা। নারী,
          শিশু, ধর্মীয় সম্প্রদায় বা ক্ষুদ্র জাতিসত্তার আত্মমর্যাদা ও অধিকারে
          নিউজপেপার বিশ্বাসী। এর সাংবাদিকতার লক্ষ্য আপামর জনমানুষের সৃষ্টিশীল
          উদ্যোগের সহযোগিতা এবং ভবিষৎমুখী মঙ্গল ও উন্নয়ন।
        </p>
      </div>
    </div>
  );
}
