import React from "react";
import { BsDot } from "react-icons/bs";

export default function Conditions() {
  return (
    <div className=" mt-[26px]">
      <div className=" flex gap-[10px] items-center">
        <BsDot className="text-[#FE0000] text-[30px]" />
        <h1 className=" mb-0 text-[25px] leading-[32px] font-normal">
          ব্যবহারের শর্তাবলি
        </h1>
      </div>
      <div className=" mt-[10px] flex flex-col gap-[20px]">
        <p className=" mb-0 text-[18px] leading-[32px] ">
          পাঠক ও ভিজিটরদের আমরা নিউজপেপার এবং এর বিভিন্ন ওয়েবসাইট, কনটেন্ট, সেবা
          ও অ্যাপ্লিকেশন ‘ব্যবহারের শর্তাবলি’ পড়তে স্বাগত জানাই।
          ডব্লিউডব্লিউডব্লিউ, ডিজিটাল ও সামাজিক যোগাযোগ প্ল্যাটফর্ম, এসএমএস,
          আরএসএস ফিড—নানা পথে পাঠকেরা আমাদের কনটেন্ট পড়ার জন্য আসতে পারেন।
          বিভিন্ন ডিভাইসের মাধ্যমে আমাদের কনটেন্টে প্রবেশ করা সম্ভব, সেসব নিছক
          কম্পিউটার, মুঠোফোন ও পিডিএর মধ্যে সীমাবদ্ধ নয়। আমাদের কনটেন্ট সেবা
          গ্রহণ করার মাধ্যমে বা কনটেন্ট, ছবি ও তথ্য দেখা বা পাঠের মাধ্যমে পাঠক ও
          দর্শনার্থীরা আমাদের ‘ব্যবহারের শর্তাবলি’ মেনে নিচ্ছেন বলে আমরা ধরে
          নেব। একই সঙ্গে তাঁরা নিউজপেপারর ‘গোপনীয়তা নীতি’ মেনে নিচ্ছেন বলেও ধরে
          নেওয়া হবে। এসব নিয়ে কারও আপত্তি বা বক্তব্য থাকলে এই ঠিকানায় ইমেইল
          পাঠিয়ে জানাতে অনুরোধ করছি: info@newspaper.com
        </p>
        <p className=" mb-0 text-[18px] leading-[32px] ">
          পাঠকের আপত্তি বা বক্তব্য গ্রহণ করা বা না করার এখতিয়ার নিউজপেপারর।
          নিউজপেপারর সব পাঠককে এই ‘ব্যবহারের শর্তাবলি’ মেনে চলতে হবে। তাঁরা তা
          না মানলে বা ব্যবহারের শর্তাবলি-পরিপন্থী কোনো কিছু ঘটলে গ্রাহকের
          অ্যাকাউন্ট স্থগিত করা থেকে তাঁদের ওয়েবসাইটে প্রবেশ ইত্যাদি নানা কিছুর
          ওপর নিষেধাজ্ঞা প্রয়োগ করা হতে পারে। নিউজপেপারর ওয়েবসাইটে প্রবেশ করা
          কিংবা অ্যাপ্লিকেশন ব্যবহার করার অর্থ হলো, গ্রাহক বা দর্শনার্থীরা
          নিউজপেপারর সেবা নিচ্ছেন এবং ‘ব্যবহারের শর্তাবলি’ মেনে নিতে সম্মতি
          দিচ্ছেন। এই সেবার মধ্যে আছে লেখা, ছবি, গ্রাফিকস, অডিও, ভিডিও,
          সফটওয়্যার ইত্যাদি।
        </p>
      </div>
    </div>
  );
}
