import React from "react";

export default function Privacy() {
  return (
    <div className=" mt-[26px]">
      <div className=" flex flex-col gap-[20px]">
        <p className="  text-[18px] leading-[32px]">
          নিউজপেপারর ওয়েবসাইট বা অ্যাপ্লিকেশন (অ্যাপ) ব্যবহার করার সময় পাঠক,
          ভিজিটর অথবা ব্যবহারকারীর তথ্য সুরক্ষিত রাখতে আমরা অঙ্গীকারবদ্ধ।
          নিম্নোক্ত মাধ্যম থেকে সেবা গ্রহণের সময় তাঁদের যেসব ব্যক্তিগত তথ্য
          সংগৃহীত হয়, এই গোপনীয়তার নীতি সেসবের ওপর প্রযোজ্য হবে:
        </p>
        <div className=" mb-3">
          <ul>
            <li>১. গোপনীয়তা নীতিসংবলিত নিউজপেপারর যেকোনো ওয়েবসাইট</li>
            <li>
              ২. সামাজিক যোগাযোগমাধ্যম বা অন্য যেকোনো ওয়েবসাইটে নিউজপেপারর
              কনটেন্ট
            </li>
            <li> ৩. মোবাইল ও ওয়েব অ্যাপ্লিকেশন (অ্যাপ)।</li>
          </ul>
        </div>

        <p className="  text-[18px] leading-[32px]">
          নিউজপেপারর তৈরি অ্যাপ্লিকেশন (অ্যাপ), ওয়েবসাইট বা কনটেন্টের ক্ষেত্রেই
          শুধু এই গোপনীয়তা নীতি প্রযোজ্য হবে। কোনো নকল ওয়েবসাইট, পেজ বা গ্রুপে
          প্রচারিত বা নিউজপেপারর লোগো-সংবলিত ভুয়া কনটেন্টের ক্ষেত্রে এই গোপনীয়তা
          নীতি প্রযোজ্য হবে না।
        </p>
        <p className="  text-[18px] leading-[32px]">
          নিউজপেপার নানা উদ্দেশ্যে পাঠকদের তথ্য সংগ্রহ করে থাকে। উদাহরণ হিসেবে
          বলা যায়, পাঠকদের সেবা দেওয়া বা সেবার মান উন্নত করা এবং বিপণন ও
          প্রচারণার উদ্দেশ্যে এসব তথ্য সংগৃহীত হয়। এসব তথ্যের মধ্যে আছে গ্রাহকের
          নাম, ঠিকানা, ফোন নম্বর, ইমেইল ঠিকানা, বয়স, সামাজিক মাধ্যমের হিসাব
          ইত্যাদি (ইনফরমেশন বা তথ্য)।
        </p>
        <p className="  text-[18px] leading-[32px]">
          নিউজপেপারর অন্যান্য সেবার ক্ষেত্রে আলাদা গোপনীয়তার নীতি প্রযোজ্য হতে
          পারে। সে জন্য পাঠকদের প্রতি অনুরোধ, ওই সব সেবার জন্য নিবন্ধন করার সময়
          তাঁরা যেন সে-সংক্রান্ত নীতিমালা পড়ে নেন। নিউজপেপার পাঠকের ব্যক্তিগত
          গোপনীয়তার প্রতি শ্রদ্ধাশীল। আর তথ্য যে উদ্দেশ্যে সংগৃহীত হয়, তা যেন
          সেই উদ্দেশ্যই ব্যবহৃত হয়, তা নিশ্চিত করার সর্বোচ্চ চেষ্টা নিউজপেপার
          করে।
        </p>
      </div>
    </div>
  );
}
